Revit 2024 API
KeyBasedTreeEntry Methods
The KeyBasedTreeEntry type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetChildrenKeys
 Gets a collection containing the keys of all children entry objects from this entry.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
KeyBasedTreeEntry Class
Autodesk.Revit.DB Namespace